---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectContext3D.VertexPositionColored
source: html/31438c12-c049-aadb-a375-0b531e897461.htm
---
# VertexPositionColored Members

Constructs the vertex from a point and a color.